Documents/Занятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Занятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаЗанятия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Стоимость</Name>
          <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/ЗагрузкаПреподавателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ЗагрузкаПреподавателей</Name>
    <RegisterType>Turnover</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Часы</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/ЗагрузкаАудиторий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ЗагрузкаАудиторий</Name>
    <RegisterType>Turnover</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Часы</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Documents/Занятие/Ext/ObjectModule.bsl
// Модуль документа Занятие

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Преподаватели") Тогда
		Преподаватель = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Контроль конфликтов перед проведением
	Конфликты = КонтрольКонфликтовРасписания.ПроверитьЗанятие(ЭтотОбъект);
	Если Конфликты.Количество() > 0 Тогда
		Текст = "Невозможно провести занятие:" + Символы.ПС;
		Для Каждого К из Конфликты Цикл
			Текст = Текст + К + Символы.ПС;
		КонецЦикла;
		ВызватьИсключение Текст;
	КонецЕсли;

	// Движения по загрузке преподавателя
	НаборЗаписей = РегистрыНакопления.ЗагрузкаПреподавателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать();

	Движение = НаборЗаписей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Преподаватель = Преподаватель;
	Движение.Часы = (ВремяОкончания - ВремяНачала) / 60;

	// Движения по загрузке аудитории
	Если Не ПустоеЗначение(Аудитория) Тогда
		НаборЗаписейАуд = РегистрыНакопления.ЗагрузкаАудиторий.СоздатьНаборЗаписей();
		НаборЗаписейАуд.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписейАуд.Записать();
		ДвижениеАуд = НаборЗаписейАуд.Добавить();
		ДвижениеАуд.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеАуд.Период = Дата;
		ДвижениеАуд.Аудитория = Аудитория;
		ДвижениеАуд.Часы = (ВремяОкончания - ВремяНачала) / 60;
	КонецЕсли;

	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ОбработкаУстановкиНовогоНомера(СтандартнаяОбработка, Префикс)
КонецПроцедуры

Процедура УдалениеПроведения(Отказ)
КонецПроцедуры

Процедура ОбработкаУдаления(Отказ)
	// Запись в аудит
	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Изменение расписания", "", Строка(Статус));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Преподаватель) Тогда
		Сообщить("Не заполнен преподаватель");
		Отказ = Истина;
	КонецЕсли;
	Если ПустоеЗначение(ВремяНачала) Тогда
		Сообщить("Не заполнено время начала");
		Отказ = Истина;
	КонецЕсли;
	Если ВремяОкончания <= ВремяНачала Тогда
		Сообщить("Время окончания должно быть позже времени начала");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаписиНового(Отказ)
КонецПроцедуры
